johnrosshunt/pocket-tank/firmware/sdkconfig.defaults
# pocket-tank — M5Stack Tab5 (October 2025, ST7123): ESP32-P4NRW32, 32 MB PSRAM,
# 16 MB flash. Board facts and their status: docs/boards/m5stack-tab5.md
CONFIG_IDF_TARGET="esp32p4"
# pre-v3 silicon (v1.x) - ASSUMED; the flash tool names the real revision and
# refuses a mismatch. A v3.x chip: drop these two lines.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
# PSRAM: 200 MHz, available to malloc; memtest off to save boot time
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=8192
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_MEMTEST=n
# the console on USB-C: the P4's USB Serial/JTAG (the board's USB-UART is not fitted)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
# no radio at runtime (the ESP32-C6 is kept powered off)
CONFIG_ESP_WIFI_ENABLED=n
CONFIG_BT_ENABLED=n
# generous main stack for the tank/render task; inference has its own task
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=n
CONFIG_COMPILER_OPTIMIZATION_PERF=y
# port phase 2: the ST7123 panel up with a bench test pattern; touch and audio
# stubbed, the tank still runs headless
# the panel's DMA restarts each frame from the DSI / DW-GDMA interrupt: kept
# running while a flash write has the cache off - otherwise a save stretches
# a frame and the ST7123 flashes white (docs/boards/m5stack-tab5.md)
CONFIG_LCD_DSI_ISR_CACHE_SAFE=y
CONFIG_POCKET_TANK_DISPLAY_TAB5=y
CONFIG_POCKET_TANK_TOUCH_TAB5=y
CONFIG_POCKET_TANK_AUDIO_TAB5=y
